# RailProfileOpen Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RailProfileOpen Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Open Profile Loop can't be used as a Rail Profile
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RailProfileOpen { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailProfileOpen As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RailProfileOpen {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace